Repository: bminor/binutils-gdb
Catalog: bfd/po/*.po
Languages: tr

source: %s: Unrecognised machine type (0x%x) in Import Library Format archive
tr: %s: Ýthal Kitaplýk Biçem (ILF) arþivinde tanýnmayan makina türü (0x%x)

source: %s: Recognised but unhandled machine type (0x%x) in Import Library Format archive
tr: %s: Ýthal Kitaplýk Biçem (ILF) arþivinde bilinen fakat desteklenmeyen makina türü (0x%x)

source: %s: size field is zero in Import Library Format header
tr: %s: Ýthal Kitaplýk Biçem (ILF) baþlýðýnda boy alaný sýfýr

source: %s: string not null terminated in ILF object file.
tr: %s: ILF nesne dosyasýnda dizge boþ deðerle sonlanmamýþ.

source: ppcboot header:
tr: ppcboot baþlýðý:

source: Entry offset = 0x%.8lx (%ld)
tr: Girdi göreli konumu = 0x%.8lx (%ld)

source: Length = 0x%.8lx (%ld)
tr: Uzunluk = 0x%.8lx (%ld)

source: Flag field = 0x%.2x
tr: Bayrak alaný = 0x%.2x

source: Partition name = "%s"
tr: Bölüm adý = "%s"

source: Partition[%d] start = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }
tr: Bölüm[%d] baþlangýcý = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }

source: Partition[%d] end = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }
tr: Bölüm[%d] sonu = { 0x%.2x, 0x%.2x, 0x%.2x, 0x%.2x }

source: Partition[%d] sector = 0x%.8lx (%ld)
tr: Bölüm[%d] sektörü = 0x%.8lx (%ld)

source: Partition[%d] length = 0x%.8lx (%ld)
tr: Bölüm[%d] uzunluðu = 0x%.8lx (%ld)

source: som_sizeof_headers unimplemented
tr: som_sizeof_headers tamamlanmamýþ

source: %s:%d: Unexpected character `%s' in S-record file
tr: %s:%d: S-kayýt dosyasýnda beklenmeyen `%s' karakteri

source: Unsupported .stab relocation
tr: Desteklenmeyen .stab yerdeðiþimi

source: bfd_make_section (%s) failed
tr: bfd_make_section (%s) baþarýsýz

source: bfd_set_section_flags (%s, %x) failed
tr: bfd_set_section_flags (%s, %x) baþarýsýz

source: Size mismatch section %s=%lx, %s=%lx
tr: Boy uyumsuzluðu bölümü %s=%lx, %s=%lx

source: unknown gsd/egsd subtype %d
tr: bilinmeyen gsd/egsd alt türü %d

source: Object module NOT error-free !
tr: Nesne modülü hatasýz DEÐÝL !

source: Stack overflow (%d) in _bfd_vms_push
tr: _bfd_vms_push'da yýðýt taþmasý (%d)

source: Stack underflow in _bfd_vms_pop
tr: _bfd_vms_pop'da yýðýt alt taþmasý

source: _bfd_vms_output_counted called with zero bytes
tr: _bfd_vms_output_counted sýfýr bayt ile çaðrýldý

source: _bfd_vms_output_counted called with too many bytes
tr: _bfd_vms_output_counted fazla bayt ile çaðrýldý

source: Symbol %s replaced by %s
tr: %s sembolü %s ile deðiþtirildi

source: failed to enter %s
tr: %s'e giriþ baþarýsýz

source: No Mem !
tr: Hafýza Yok !

source: PASSMECH not fully implemented
tr: PASSMECH tamamlanmamýþ

source: SEC_RELOC with no relocs in section %s
tr: %s bölümünde yerdeðiþim olmaksýzýn SEC_RELOC

source: Unhandled relocation %s
tr: Desteklenmeyen yerdeðiþim %s

source: %s: `%s' has line numbers but no enclosing section
tr: %s: `%s' satýr numaralarýna sahip fakat onu içeren bölümü yok

source: %s: class %d symbol `%s' has no aux entries
tr: %s: sýnýf %d sembol `%s'un alternatif girdileri yok

source: %s: symbol `%s' has unrecognized csect type %d
tr: %s: `%s' sembolünde bilinmeyen csect türü %d var

source: %s: bad XTY_ER symbol `%s': class %d scnum %d scnlen %d
tr: %s: hatalý XTY_ER sembolü `%s': sýnýf %d scnum %d scnlen %d

source: %s: XMC_TC0 symbol `%s' is class %d scnlen %d
tr: %s: XMC_TC0 sembolü `%s': sýnýf %d scnlen %d

source: %s: csect `%s' not in enclosing section
tr: %s: csect `%s' onu içeren bölümde deðil

source: %s: misplaced XTY_LD `%s'
tr: %s: XTY_LD `%s'yanlýþ yerde

source: %s: reloc %s:%d not in csect
tr: %s: yerdeðiþim %s:%d csect içinde deðil

source: %s: XCOFF shared object when not producing XCOFF output
tr: %s: XCOFF çýktýsý oluþturulmazken XCOFF paylaþýmlý nesnesi

source: %s: dynamic object with no .loader section
tr: %s: .loader bölümü olmayan dinamik nesne

source: %s: no such symbol
tr: %s: böyle bir sembol yok

source: warning: attempt to export undefined symbol `%s'
tr: uyarý: tanýmlanmamýþ `%s' sembolünü ihraç denemesi

source: TOC overflow: 0x%lx > 0x10000; try -mminimal-toc when compiling
tr: TOC taþmasý: 0x%lx > 0x10000; -mminimal-toc ile derlemeyi deneyin

source: %s: loader reloc in unrecognized section `%s'
tr: %s: bilinmeyen `%s' bölümünde yükleyici yerdeðiþimi

source: %s: `%s' in loader reloc but not loader sym
tr: %s: `%s' yükleyici yerdeðiþiminde fakat yükleyici sembolü deðil

source: %s: loader reloc in read-only section %s
tr: %s: %s salt-okunur bölümünde yükleyici yerdeðiþimi

source: %s: line number overflow: 0x%lx > 0xffff
tr: %s: satýr numarasý taþmasý: 0x%lx > 0xffff

source: %s: reloc overflow 1: 0x%lx > 0xffff
tr: %s: yerdeðiþim taþmasý 1: 0x%lx > 0xffff

source: Export Directory [.edata (or where ever we found it)]
tr: Ýhraç Dizini [.edata (veya nerede bulundu ise)]

source: Import Directory [parts of .idata]
tr: Ýthal Dizini [.idata'nýn parçalarý]

source: Resource Directory [.rsrc]
tr: Kaynak Dizini [.rsrc]

source: Exception Directory [.pdata]
tr: Ýstisna Dizini [.pdata]

source: Security Directory
tr: Güvenlik Dizini

source: Base Relocation Directory [.reloc]
tr: Temel Yerdeðiþim Dizini [.reloc]

source: Debug Directory
tr: Hata Ayýklama Dizini

source: Description Directory
tr: Açýklama Dizini

source: Special Directory
tr: Özel Dizin

source: Thread Storage Directory [.tls]
tr: Dal Saklama Dizini [.tls]

source: Load Configuration Directory
tr: Ayar Yükleme Dizini

source: Bound Import Directory
tr: Sýnýr Ýthal Dizini

source: Import Address Table Directory
tr: Adres Tablosu Ýthal Dizini

source: Delay Import Directory
tr: Gecikmeli Ýthal Dizini

source: Reserved
tr: Ayrýlmýþ

source: There is an import table, but the section containing it could not be found
tr: Bir ithal tablosu var, fakat onu içeren bölüm bulunamadý

source: There is an import table in %s at 0x%lx
tr: %s içerisinde 0x%lx'de bir ithal tablosu var

source: Function descriptor located at the start address: %04lx
tr: Baþlangýç adresinde iþlev betimleyicisi bulundu: %04lx

source: code-base %08lx toc (loadable/actual) %08lx/%08lx
tr: kod temeli %08lx toc (yüklenebilir/gerçek) %08lx/%08lx

source: No reldata section! Function descriptor not decoded.
tr: Reldata bölümü yok! Ýþlev betimleyicisi çözümlenemedi.

source: The Import Tables (interpreted %s section contents)
tr: Ýthal Tablolarý (%s bölüm içeriði çözümlendi)

source: DLL Name: %s
tr: DLL Adý: %s

source: vma: Hint/Ord Member-Name
tr: vma: Ýpucu/Sýra Üye-Adý

source: The Import Address Table (difference found)
tr: Ýthal Adres Tablosu (fark bulundu)

source: >>> Ran out of IAT members!
tr: >>> IAT üyeleri bitti!

source: The Import Address Table is identical
tr: Ýthal Adres Tablosu ayný

source: There is an export table, but the section containing it could not be found
tr: Bir ihraç tablosu var, fakat onu içeren bölüm bulunamadý

source: There is an export table in %s at 0x%lx
tr: %s içinde 0x%lx'de bir ihraç tablosu var

source: The Export Tables (interpreted %s section contents)
tr: Ýhraç Tablolarý (%s bölüm içeriði çözümlendi)

source: Export Flags %lx
tr: Ýhraç Bayraklarý %lx

source: Time/Date stamp %lx
tr: Saat/Tarih damgasý %lx

source: Major/Minor %d/%d
tr: Majör/Minör %d/%d

source: Name
tr: Ýsim

source: Ordinal Base %ld
tr: Onluk Sistem %ld

source: Number in:
tr: Sayý içinde:

source: Export Address Table %08lx
tr: Ýhraç Adres Tablosu %08lx

source: [Name Pointer/Ordinal] Table %08lx
tr: [Ýsim Gösterge/Onluk] Tablo %08lx

source: Table Addresses
tr: Tablo Adresleri

source: Export Address Table
tr: Ýhraç Adres Tablosu

source: Name Pointer Table
tr: Ýsim Gösterge Tablosu

source: Ordinal Table
tr: Onluk Tablo

source: Export Address Table -- Ordinal Base %ld
tr: Ýhraç Adres Tablosu -- Onluk Sistem %ld

source: Forwarder RVA
tr: RVA Yönlendiricisi

source: Export RVA
tr: RVA Ýhracý

source: [Ordinal/Name Pointer] Table
tr: [Onluk/Ýsim Gösterge] Tablosu

source: Warning, .pdata section size (%ld) is not a multiple of %d
tr: Uyarý, .pdata bölüm boyu (%ld) %d'nin katý deðil

source: The Function Table (interpreted .pdata section contents)
tr: Ýþlev Tablosu (.pdata bölüm içeriði çözümlendi)

source: vma: Begin Address End Address Unwind Info
tr: vma: Baþlangýç Adresi Sonlanma Adresi Geri Al Bilgisi

source: Register save millicode
tr: Yazma milikodunu kaydet

source: Register restore millicode
tr: Geri alma milikodunu kaydet

source: Glue code sequence
tr: Birleþtirici kod dizisi

source: PE File Base Relocations (interpreted .reloc section contents)
tr: PE Dosya Temel Yerdeðiþimi (.reloc bölüm içeriði çözümlendi)

source: Virtual Address: %08lx Chunk size %ld (0x%lx) Number of fixups %ld
tr: Sanal Adres: %08lx Parça boyu %ld (0x%lx) Düzeltme Sayýsý %ld

source: reloc %4d offset %4x [%4lx] %s
tr: yer deðiþim %4d göreli konum %4x [%4lx] %s

source: Characteristics 0x%x
tr: Özellikler 0x%x
