Repository: bminor/binutils-gdb
Catalog: bfd/po/*.po
Languages: tr

source: %s: Unknown section type in a.out.adobe file: %x
tr: %s: a.out.adobe dosyasýnda bilinmeyen bölüm türü: %x

source: %s: Invalid relocation type exported: %d
tr: %s: Geçersiz yer deðiþtirme türü ihraç edilmiþ: %d

source: %s: Invalid relocation type imported: %d
tr: %s: Geçersiz yer deðiþtirme türü ithal edilmiþ: %d

source: %s: Bad relocation record imported: %d
tr: %s: Geçersiz yer deðiþtirme kaydý ithal edilmiþ: %d

source: %s: can not represent section `%s' in a.out object file format
tr: %s: `%s' bölümü a.out nesne dosya biçeminde gösterilemez

source: %s: can not represent section for symbol `%s' in a.out object file format
tr: %s: `%s' sembol bölümü a.out nesne dosyasýnda gösterilemez

source: *unknown*
tr: *bilinmeyen*

source: %s: relocateable link from %s to %s not supported
tr: %s: %s'dan %s'ya yeri deðiþtirilebilen bað desteklenmiyor

source: Warning: writing archive was slow: rewriting timestamp
tr: Uyarý: arþiv yazma iþlemi yavaþ: zaman damgasý yeniden yazýlýyor

source: Reading archive file mod timestamp
tr: Arþiv dosyasý deðiþim zaman damgasý okunuyor

source: Writing updated armap timestamp
tr: Güncellenmiþ armap zaman damgasý yazýlýyor

source: No error
tr: Hata yok

source: System call error
tr: Sistem çaðrý hatasý

source: Invalid bfd target
tr: Geçersiz bfd hedefi

source: File in wrong format
tr: Dosya yanlýþ biçemde

source: Invalid operation
tr: Geçersiz iþlem

source: Memory exhausted
tr: Bellek tükendi

source: No symbols
tr: Sembol yok

source: Archive has no index; run ranlib to add one
tr: Arþivin indeksi yok; ranlib çalýþtýrarak indeks ekleyin

source: No more archived files
tr: Baþka arþivlenmiþ dosya yok

source: Malformed archive
tr: Bozuk arþiv

source: File format not recognized
tr: Dosya biçemi tanýnmýyor

source: File format is ambiguous
tr: Dosya biçemi belirsiz

source: Section has no contents
tr: Bölümde içerik yok

source: Nonrepresentable section on output
tr: Çýktýda gösterilemeyen bölüm

source: Symbol needs debug section which does not exist
tr: Sembol, olmayan hata ayýklama bölümünü istiyor

source: Bad value
tr: Geçersiz deðer

source: File truncated
tr: Dosya budandý

source: File too big
tr: Dosya fazla büyük

source: #<Invalid error code>
tr: #<Geçersiz hata kodu>

source: Please report this bug.
tr: Lütfen bu hatayý bildirin.

source: Warning: Writing section `%s' to huge (ie negative) file offset 0x%lx.
tr: Uyarý: `%s' bölümü çok büyük (negatif) dosya göreli konumu 0x%lx'e yazýlýyor.

source: Missing IHCONST
tr: IHCONST yok

source: Missing IHIHALF
tr: IHIHALF yok

source: Unrecognized reloc
tr: Tanýnmayan yer deðiþtirme

source: missing IHCONST reloc
tr: eksik IHCONST yer deðiþtirmesi

source: missing IHIHALF reloc
tr: eksik IHIHALF yer deðiþtirmesi

source: GP relative relocation used when GP not defined
tr: GP tanýmlanmamýþken GP göreli yer deðiþtirmesi kullanýlmýþ

source: using multiple gp values
tr: birden fazla gp deðeri kullanýlýyor

source: %s: unable to find THUMB glue '%s' for `%s'
tr: %1$s: `%3$s' için THUMB birleþtiricisi '%2$s' bulunamadý

source: %s: unable to find ARM glue '%s' for `%s'
tr: %1$s: `%3$s' için ARM birleþtiricisi '%2$s' bulunamadý

source: %s(%s): warning: interworking not enabled.
tr: %s(%s): uyarý: beraber çalýþma kipi etkin deðil.

source: first occurrence: %s: arm call to thumb
tr: ilk ortaya çýkýþ: %s: thumb'a arm'dan çaðrý

source: first occurrence: %s: thumb call to arm
tr: ilk ortaya çýkýþ: %s: arm'a thumb'dan çaðrý

source: consider relinking with --support-old-code enabled
tr: --support-old-code seçeneði ile yeniden baðlamayý deneyin

source: %s: bad reloc address 0x%lx in section `%s'
tr: %1$s: `%3$s' bölümünde geçersiz yer deðiþtirme adresi 0x%2$lx

source: %s: illegal symbol index in reloc: %d
tr: %s: yer deðiþtirmede geçersiz sembol indeksi: %d

source: %s: ERROR: compiled for APCS-%d whereas target %s uses APCS-%d
tr: %s: HATA: APCS-%d için derlenmiþ fakat hedef %s APCS-%d kullanýyor

source: %s: ERROR: passes floats in float registers whereas target %s uses integer registers
tr: %s: HATA: kayan sayýlarý kayan yazmaçlarda geçiriyor fakat hedef %s tamsayý yazmaç kullanýyor

source: %s: ERROR: passes floats in integer registers whereas target %s uses float registers
tr: %s: HATA: kayan sayýlarý tamsayý yazmaçlarda geçiriyor fakat hedef %s kayan yazmaç kullanýyor

source: %s: ERROR: compiled as position independent code, whereas target %s is absolute position
tr: %s: HATA: yerden baðýmsýz kod olarak derlendi, fakat hedef %s yere baðýmlý

source: %s: ERROR: compiled as absolute position code, whereas target %s is position independent
tr: %s: HATA: yere baðýmlý kod olarak derlendi, fakat hedef %s yerden baðýmsýz

source: private flags = %x:
tr: özel bayraklar = %x:

source: [floats passed in float registers]
tr: [kayan sayýlar kayan yazmaçlarda geçirildi]

source: [floats passed in integer registers]
tr: [kayan sayýlar tamsayý yazmaçlarda geçirildi]

source: [position independent]
tr: [yerden baðýmsýz]

source: [absolute position]
tr: [yere baðýmlý]

source: [interworking flag not initialised]
tr: [beraber çalýþma bayraðýna öndeðer atanmamýþ]

source: [interworking supported]
tr: [beraber çalýþma destekleniyor]

source: [interworking not supported]
tr: [beraber çalýþma desteklenmiyor]

source: Warning: Clearing the interworking flag of %s due to outside request
tr: Uyarý: %s beraber çalýþma bayraðý dýþ istek üzerine temizlendi

source: uncertain calling convention for non-COFF symbol
tr: COFF olmayan sembol için belirsiz çaðrý davranýþý

source: unsupported reloc type
tr: desteklenmeyen yer deðiþtirme türü

source: GP relative relocation when _gp not defined
tr: _gp tanýmsýz iken GP göreli yer deðiþtirmesi

source: reloc against unsupported section
tr: desteklenmeyen bölümde yer deðiþtirme

source: reloc not properly aligned
tr: yer deðiþtirme doðru hizalanmamýþ

source: %s: unsupported relocation type 0x%02x
tr: %s: desteklenmeyen yükleyici yerdeðiþimi 0x%02x

source: %s: TOC reloc at 0x%x to symbol `%s' with no TOC entry
tr: %s: 0x%x'da TOC girdisi olmayan `%s' sembolüne TOC yerdeðiþimi

source: %s: symbol `%s' has unrecognized smclas %d
tr: %s: `%s' sembolünde bilinmeyen %d var

source: Unrecognized reloc type 0x%x
tr: Bilinmeyen yer deðiþtirme türü 0x%x

source: %s: warning: illegal symbol index %ld in relocs
tr: %s: uyarý: yer deðiþtirmelerde geçersiz sembol indeksi %ld

source: ignoring reloc %s
tr: yer deðiþtirme %s yoksayýldý

source: Unrecognized TI COFF target id '0x%x'
tr: Tanýnmayan TI COFF hedef kimliði '0x%x'

source: %s: warning: illegal symbol index %ld in line numbers
tr: %s: uyarý: satýr numaralarýnda geçersiz sembol indeksi %ld

source: %s: warning: duplicate line number information for `%s'
tr: %s: uyarý: `%s' için tekrarlanmýþ satýr numarasý bilgisi

source: %s: Unrecognized storage class %d for %s symbol `%s'
tr: %1$s: %3$s sembolü `%4$s' için bilinmeyen saklama sýnýfý %2$d

source: warning: %s: local symbol `%s' has no section
tr: uyarý: %s: `%s' yerel sembolünün bölümü yok

source: %s: illegal relocation type %d at address 0x%lx
tr: %1$s: 0x%3$lx adresinde geçersiz yer deðiþtirme türü %2$d

source: %s: bad string table size %lu
tr: %s: geçersiz dizge tablo boyu %lu

source: Warning: type of symbol `%s' changed from %d to %d in %s
tr: Uyarý: %4$s içerisinde `%1$s' sembolünün türü %2$d'den %3$d'e deðiþtirildi

source: %s: relocs in section `%s', but it has no contents
tr: %s: `%s' bölümünde yer deðiþtirmeler mevcut, fakat içi boþ

source: %s: %s: reloc overflow: 0x%lx > 0xffff
tr: %s: %s: yer deðiþtirme taþmasý: 0x%lx > 0xffff

source: %s: warning: %s: line number overflow: 0x%lx > 0xffff
tr: %s: uyarý: %s: satýr numarasý taþmasý: 0x%lx > 0xffff

source: Dwarf Error: Can't find .debug_abbrev section.
tr: Dwarf Hatasý: .debug_abbrev bölümü bulunamadý.

source: Dwarf Error: Invalid or unhandled FORM value: %d.
tr: Dwarf Hatasý: Geçersiz veya desteklenmeyen FORM deðeri: %d.

source: Dwarf Error: mangled line number section (bad file number).
tr: Dwarf Hatasý: bozulmuþ satýr numarasý bölümü (geçersiz dosya numarasý).

source: Dwarf Error: Can't find .debug_line section.
tr: Dwarf Hatasý: .debug_line bölümü bulunamadý.

source: Dwarf Error: mangled line number section.
tr: Dwarf Hatasý: bozuk satýr numarasý bölümü.

source: Dwarf Error: Could not find abbrev number %d.
tr: Dwarf Hatasý: Kýsaltma numarasý %d bulunamadý.

source: Dwarf Error: found dwarf version '%hu', this reader only handles version 2 information.
tr: Dwarf Hatasý: dwarf sürümü '%hu' bulundu, bu okuyucu yalnýzca sürüm 2 bilgisini anlayabiliyor.

source: Dwarf Error: found address size '%u', this reader can not handle sizes greater than '%u'.
tr: Dwarf Hatasý: adres boyu '%u' bulundu, bu okuyucu '%u'dan daha büyük boylarý okuyamýyor.

source: Dwarf Error: Bad abbrev number: %d.
tr: Dwarf Hatasý: Geçersiz kýsaltma numarasý: %d.

source: Unknown basic type %d
tr: Bilinmeyen temel tür %d

source: End+1 symbol: %ld
tr: Son+1 sembolü: %ld

source: First symbol: %ld
tr: Ýlk sembol: %ld

source: End+1 symbol: %-7ld Type: %s
tr: Son+1 sembolü: %-7ld Tür: %s

source: Local symbol: %ld
tr: Yerel sembol: %ld

source: struct; End+1 symbol: %ld
tr: yapý; Son+1 sembolü: %ld

source: union; End+1 symbol: %ld
tr: birleþim; Son+1 sembolü: %ld

source: enum; End+1 symbol: %ld
tr: enum; Son+1 sembolü: %ld

source: Type: %s
tr: Tür: %s

source: %s: warning: unresolvable relocation against symbol `%s' from %s section
tr: %1$s: uyarý: %3$s bölümünden `%2$s' sembolüne çözümlenemeyen yer deðiþimi

source: internal error: out of range error
tr: iç hata: kapsam dýþý hatasý

source: internal error: unsupported relocation error
tr: iç hata: desteklenmeyen yer deðiþim hatasý

source: internal error: dangerous error
tr: iç hata: ölümcül hata

source: internal error: unknown error
tr: iç hata: bilinmeyen hata

source: %s: invalid string offset %u >= %lu for section `%s'
tr: %1$s: `%4$s' bölümünde geçersiz dizge göreli konumu %2$u >= %3$lu

source: Program Header:
tr: Yazýlým Baþlýðý:

source: Dynamic Section:
tr: Dinamik Bölüm:

source: Version definitions:
tr: Sürüm tanýmlarý:

source: Version References:
tr: Sürüm Referanslarý:

source: required from %s:
tr: %s'den isteniyor:

source: %s: invalid link %lu for reloc section %s (index %u)
tr: %1$s: yerdeðiþim bölümü %3$s (indeks %4$u) için geçersiz bað %2$lu

source: %s: Not enough room for program headers (allocated %u, need %u)
tr: %s: Yazýlým baþlýklarý için yeterli yer yok (%u ayrýldý, %u gerekli)

source: %s: Not enough room for program headers, try linking with -N
tr: %s: yazýlým baþlýklarý için gerekli yer yok, -N ile baðlamayý deneyin

source: %s: warning: allocated section `%s' not in segment
tr: %s: uyarý: ayrýlmýþ `%s' bölümü parça içinde deðil

source: %s: symbol `%s' required but not present
tr: %s: `%s' sembolü gerekli fakat mevcut deðil

source: %s: warning: Empty loadable segment detected
tr: %s: uyarý: Boþ yüklenebilir parça bulundu

source: %s: unsupported relocation type %s
tr: %s: desteklenmeyen yerdeðiþim türü %s

source: %s: Warning: Arm BLX instruction targets Arm function '%s'.
tr: %s: Uyarý: Arm BLX iþlemi Arm iþlevi '%s' hedefliyor.

source: %s: Warning: Thumb BLX instruction targets thumb function '%s'.
tr: %s: Uyarý: Thumb BLX iþlemi thumb iþlevi '%s'ý hedefliyor.

source: Error: %s compiled for EABI version %d, whereas %s is compiled for version %d
tr: Hata: %s EABI sürüm %d için derlenmiþ, fakat %s %d sürümü için derlenmiþ

source: Error: %s compiled for APCS-%d, whereas %s is compiled for APCS-%d
tr: Hata: %s APCS-%d için derlenmiþ, fakat %s APCS-%d için derlenmiþ

source: private flags = %lx:
tr: özel bayraklar = %lx:

source: [interworking enabled]
tr: [beraber çalýþma etkinleþtirilmiþ]

source: [new ABI]
tr: [yeni ABI]

source: [old ABI]
tr: [eski ABI]

source: [software FP]
tr: [yazýlým FP]

source: [Version1 EABI]
tr: [Sürüm1 EABI]

source: [sorted symbol table]
tr: [sýralanmýþ sembol tablosu]

source: [unsorted symbol table]
tr: [sýralanmamýþ sembol tablosu]

source: <EABI version unrecognised>
tr: <EABI sürümü bilinmiyor>

source: [relocatable executable]
tr: [yer deðiþtirebilir uygulama]

source: [has entry point]
tr: [girdi noktasý var]

source: <Unrecognised flag bits set>
tr: <Bilinmeyen bayrak bitleri atanmýþ>

source: internal error: dangerous relocation
tr: iç hata: tehlikeli yer deðiþim

source: [symbols have a _ prefix]
tr: [semboller _ önekine sahip]

source: %s: uses _-prefixed symbols, but writing file with non-prefixed symbols
tr: %s: _-önekli sembolleri kullanýyor, fakat dosyaya öneksiz sembolleri yazýyor

source: %s: uses non-prefixed symbols, but writing file with _-prefixed symbols
tr: %s: öneksiz sembolleri kullanýyor, fakat dosyaya _-önekli sembolleri yazýyor

source: %s: cannot create stub entry %s
tr: %s: koçan giriþi %s oluþturulamadý

source: %s(%s+0x%lx): cannot reach %s, recompile with -ffunction-sections
tr: %s(%s+0x%lx): %s'e ulaþýlamadý, -ffunction-sections ile derleyin

source: %s: relocation %s can not be used when making a shared object; recompile with -fPIC
tr: %s: %s yer deðiþimi paylaþýmlý nesne oluþturulurken kullanýlamaz; -fPIC ile yeniden derleyin

source: %s: relocation %s should not be used when making a shared object; recompile with -fPIC
tr: %s: %s yer deðiþimi paylaþýmlý nesne oluþtururken kullanýlamaz; -fPIC ile yeniden derleyin

source: Could not find relocation section for %s
tr: %s için yer deðiþtirme bölümü bulunamadý

source: %s: duplicate export stub %s
tr: %s: birden fazla ihraç koçaný %s

source: %s(%s+0x%lx): fixing %s
tr: %s(%s+0x%lx): %s düzeltiliyor

source: %s(%s+0x%lx): cannot handle %s for %s
tr: %1$s(%2$s+0x%3$lx): %5$s için %4$s iþlenemedi

source: .got section not immediately after .plt section
tr: .got bölümü .plt bölümünün hemen arkasýnda deðil

source: %s: invalid relocation type %d
tr: %s: geçersiz yer deðiþim türü %d

source: SDA relocation when _SDA_BASE_ not defined
tr: _SDA_BASE_ tanýmlanmamýþ iken SDA yer deðiþimi

source: %s: unknown relocation type %d
tr: %s: bilinmeyen yer deðiþim türü %d

source: %s: The target (%s) of an %s relocation is in the wrong section (%s)
tr: %1$s: Bir %3$s yer deðiþiminin hedefi (%2$s) yanlýþ bölümde (%4$s)

source: %s: Instruction set mismatch with previous modules
tr: %s: Önceki modüllerle iþlem uyuþmazlýðý

source: private flags = %lx
tr: özel bayraklar = %lx

source: : m32r instructions
tr: : m32r iþlemleri

source: : m32rx instructions
tr: : m32rx iþlemleri

source: %s: Relocation %s (%d) is not currently supported.
tr: %s: %s (%d) yer deðiþimi henüz desteklenmiyor.

source: %s: Unknown relocation type %d
tr: %s: Bilinmeyen yer deðiþim türü %d

source: 32bits gp relative relocation occurs for an external symbol
tr: 32 bitlik gp göreceli yer deðiþim bir dýþ sembol için yapýlýyor

source: Linking mips16 objects into %s format is not supported
tr: mips16 nesnelerini %s biçemine baðlamak desteklenmiyor

source: %s: linking PIC files with non-PIC files
tr: %s: PIC dosyalarý PIC olmayan dosyalarla baðlanýyor

source: %s: linking abicalls files with non-abicalls files
tr: %s: abicalls dosyalarý abicalls olmayan dosyalarla baðlanýyor

source: %s: ISA mismatch (-mips%d) with previous modules (-mips%d)
tr: %1$s: Önceki modüllerle (-mips%3$d) ile ISA uyumsuzluðu (-mips%2$d)

source: %s: ISA mismatch (%d) with previous modules (%d)
tr: %1$s: Önceki modüllerle (%3$d) ile ISA uyumsuzluðu (%2$d)

source: %s: ABI mismatch: linking %s module with previous %s modules
tr: %s: ABI uyumsuzluðu: %s modülü önceki %s modülle baðlanýyor

source: %s: uses different e_flags (0x%lx) fields than previous modules (0x%lx)
tr: %1$s: önceki modüllerden (0x%3$lx) farklý e_flags (0x%2$lx) alanlarý kullanýlýyor

source: [abi unknown]
tr: [abi bilinmiyor]

source: [no abi set]
tr: [abi atanmamýþ]

source: [unknown ISA]
tr: [bilinmeyen ISA]

source: [32bitmode]
tr: [32bitkipi]

source: [not 32bitmode]
tr: [32bitkipi deðil]

source: static procedure (no name)
tr: statik altyordam (isimsiz)

source: %s: illegal section name `%s'
tr: %s: geçersiz bölüm adý `%s'

source: not enough GOT space for local GOT entries
tr: yerel GOT girdileri için yeterli GOT yeri yok

source: %s: %s+0x%lx: jump to stub routine which is not jal
tr: %s: %s+0x%lx: jal olmayan koçan yordamýna sýçrama

source: %s: CALL16 reloc at 0x%lx not against global symbol
tr: %s: 0x%lx'deki CALL16 yerdeðiþimi evrensel sembole göre deðil

source: %s: compiled with -mrelocatable and linked with modules compiled normally
tr: %s: -mrelocatable ile derlendi ve normal derlenmiþ modüllerle baðlandý

source: %s: compiled normally and linked with modules compiled with -mrelocatable
tr: %s: normal derlendi ve -mrelocatable ile derlenmiþ modüllere baðlandý

source: %s: Unknown special linker type %d
tr: %s: Bilinmeyen özel baðlayýcý türü %d

source: %s: relocation %s cannot be used when making a shared object
tr: %s: %s yerdeðiþimi paylaþýmlý nesne oluþturulurken kullanýlamaz

source: %s: unknown relocation type %d for symbol %s
tr: %1$s: %3$s sembolü için bilinmeyen %2$d türünde yerdeðiþimi

source: %s: The target (%s) of a %s relocation is in the wrong output section (%s)
tr: %1$s: %3$s yerdeðiþiminin hedefi (%2$s) yanlýþ çýktý bölümünde (%4$s)

source: %s: Relocation %s is not yet supported for symbol %s.
tr: %s: %s yerdeðiþimi %s sembolü için henüz desteklenmiyor.

source: %s: 0x%lx: warning: bad R_SH_USES offset
tr: %s: 0x%lx: uyarý: hatalý R_SH_USES göreli konumu

source: %s: 0x%lx: warning: R_SH_USES points to unrecognized insn 0x%x
tr: %s: 0x%lx: uyarý: R_SH_USES bilinmeyen insn 0x%x'ý imliyor

source: %s: 0x%lx: warning: bad R_SH_USES load offset
tr: %s: 0x%lx: uyarý: hatalý R_SH_USES yükleme göreli konumu

source: %s: 0x%lx: warning: could not find expected reloc
tr: %s: 0x%lx: uyarý: beklenen yerdeðiþim bulunamadý

source: %s: 0x%lx: warning: symbol in unexpected section
tr: %s: 0x%lx: uyarý: beklenmeyen bölümde sembol

source: %s: 0x%lx: warning: could not find expected COUNT reloc
tr: %s: 0x%lx: uyarý: beklenen COUNT yerdeðiþimi bulunamadý

source: %s: 0x%lx: warning: bad count
tr: %s: 0x%lx: uyarý: hatalý sayým

source: %s: 0x%lx: fatal: reloc overflow while relaxing
tr: %s: 0x%lx: ölümcül: gevþetilirken yerdeðiþim taþmasý

source: %s: probably compiled without -fPIC?
tr: %s: acaba -fPIC olmaksýzýn mý derlenmiþ?

source: %s: compiled for a 64 bit system and target is 32 bit
tr: %s: 64 bitlik sistem için derlenmiþ ve hedef 32 bit

source: %s: linking little endian files with big endian files
tr: %s: küçük sonlu dosyalar büyük sonlu dosyalarla baðlanýyor

source: Variable `%s' cannot occupy in multiple small data regions
tr: `%s' deðiþkeni birden fazla küçük veri sahasýný kapsayamaz

source: Variable `%s' can only be in one of the small, zero, and tiny data regions
tr: `%s' deðiþkeni küçük, sýfýr ve ufak veri sahalarýndan yalnýz birinde olabilir

source: Variable `%s' cannot be in both small and zero data regions simultaneously
tr: `%s' deðiþkeni ayný anda hem küçük hem sýfýr veri sahalarýnda bulunamaz

source: Variable `%s' cannot be in both small and tiny data regions simultaneously
tr: `%s' deðiþkeni ayný anda hem küçük hem ufak veri sahalarýnda bulunamaz

source: Variable `%s' cannot be in both zero and tiny data regions simultaneously
tr: `%s' deðiþkeni ayný anda hem sýfýr hem ufak veri sahalarýnda bulunamaz

source: FAILED to find previous HI16 reloc
tr: önceki HI16 yerdeðiþimi BULUNAMADI

source: could not locate special linker symbol __gp
tr: özel baðlayýcý sembolü __gp bulunamadý

source: could not locate special linker symbol __ep
tr: özel baðlayýcý sembolü __ep bulunamadý

source: could not locate special linker symbol __ctbp
tr: özel baðlayýcý sembolü __ctbp bulunamadý

source: %s: Architecture mismatch with previous modules
tr: %s: Önceki modüllerle platform uyumsuzluðu

source: private flags = %lx:
tr: özel bayraklar = %lx:

source: v850 architecture
tr: v850 platformu

source: v850e architecture
tr: v850e platformu

source: v850ea architecture
tr: v850ea platformu

source: GPDISP relocation did not find ldah and lda instructions
tr: GPDISP yerdeðiþimi ldah ve lda iþlemlerini bulamadý

source: %s: .got subsegment exceeds 64K (size %d)
tr: %s: .got alt parçasý 64K'yý aþýyor (boy %d)

source: %s: compiled for a big endian system and target is little endian
tr: %s: büyük sonlu sistem için derlenmiþ ve hedef küçük sonlu

source: %s: compiled for a little endian system and target is big endian
tr: %s: küçük sonlu sistem için derlenmiþ ve hedef büyük sonlu

source: %s: check_relocs: unhandled reloc type %d
tr: %s: check_relocs: desteklenmeyen yerdeðiþim türü %d

source: %s: Only registers %%g[2367] can be declared using STT_REGISTER
tr: %s: Yalnýz %%g[2367] yazmaçlarý STT_REGISTER ile bildirilebilir

source: %s: linking UltraSPARC specific with HAL specific code
tr: %s: UltraSPARC'a özel kod HAL'e özel kod ile baðlanýyor

source: %s: version count (%ld) does not match symbol count (%ld)
tr: %s: sürüm sayýsý (%ld) sembol sayýsý (%ld) ile eþleþmiyor

source: %s: warning: unexpected redefinition of `%s'
tr: %s: uyarý: `%s' için beklenmeyen yeniden tanýmlama

source: %s: %s: invalid version %u (max %d)
tr: %s: %s: geçersiz sürüm %u (maksimum %d)

source: %s: %s: invalid needed version %d
tr: %s: %s: geçersiz gerekli sürüm %d

source: Warning: size of symbol `%s' changed from %lu to %lu in %s
tr: Uyarý: `%s' sembolünün boyu %lu'dan %lu'ya %s içerisinde deðiþti

source: warning: type and size of dynamic symbol `%s' are not defined
tr: uyarý: `%s' dinamik sembolünün türü ve boyu tanýmlý deðil

source: %s: undefined versioned symbol name %s
tr: %s: sürümlü sembol ismi %s tanýmlý deðil

source: %s: could not find output section %s for input section %s
tr: %1$s: girdi bölümü %3$s için çýktý bölümü %2$s bulunamadý

source: Output file requires shared library `%s'
tr: Çýktý dosyasý için paylaþýmlý kitaplýk `%s' gerekli

source: Output file requires shared library `%s.so.%s'
tr: Çýktý dosyasý için paylaþýmlý kitaplýk `%s.so.%s' gerekli

source: Symbol %s not defined for fixups
tr: %s sembolü düzeltmeler için tanýmlý deðil

source: Warning: fixup count mismatch
tr: Uyarý: düzeltme sayý uyumsuzluðu

source: %s: string too long (%d chars, max 65535)
tr: %s: dizge fazla uzun (%d karakter, en fazla 65535)

source: %s: unrecognized symbol `%s' flags 0x%x
tr: %s: bilinmeyen `%s' sembol bayraklarý 0x%x

source: %s: unexpected ATN type %d in external part
tr: %s: dýþ parçada beklenmeyen ATN türü %d

source: %s: unexpected type after ATN
tr: %s: ATN'den sonra beklenmeyen tür

source: %s:%d: unexpected character `%s' in Intel Hex file
tr: %s:%d: Intel Onaltýlýk dosyasýnda beklenmeyen `%s' karakteri

source: %s: internal error in ihex_read_section
tr: %s: ihex_read_section'da iç hata

source: %s: bad section length in ihex_read_section
tr: %s: ihex_read_section'da hatalý bölüm uzunluðu

source: not mapping: data=%lx mapped=%d
tr: eþlenmeyen: veri=%lx eþleþen=%d

source: not mapping: env var not set
tr: eþlenmeyen: çevre deðiþkeni atanmamýþ

source: Attempt to do relocateable link with %s input and %s output
tr: %s girdi ve %s çýktýsý ile yerdeðiþimli bað deneniyor

source: %s: can not represent section `%s' in oasys
tr: %s: oasys'de `%s' bölümü gösterilemiyor

source: Unhandled OSF/1 core file section type %d
tr: Desteklenmeyen OSF/1 core dosyasý bölüm türü %d

source: %s: `ld -r' not supported with PE MIPS objects
tr: %s: `ld -r' PE MIPS nesneleri ile birlikte desteklenmiyor

source: %s: unimplemented %s
tr: %s: tamamlanmamýþ %s

source: %s: jump too far away
tr: %s: sýçrama fazla uzak

source: %s: bad pair/reflo after refhi
tr: %s: refhi'den sonra hatalý çift/reflo

source: %s: Unhandled import type; %x
tr: %s: Desteklenmeyen ithal türü; %x

source: %s: Unrecognised import type; %x
tr: %s: Tanýnmayan ithal türü; %x

source: %s: Unrecognised import name type; %x
tr: %s: Tanýnmayan ithal isim türü; %x
